; domain
(define (domain domain1-no-realloc)

(:requirements :adl)

(:types
    trackpart track trainunit - object
    icm virm sng slt - trainunit ; these are the different types of train units
)

(:predicates 
    (nextTo ?x ?y - trackpart) ;track part x next to other track part y
    (onTrack ?x - trackPart ?y - track) ;track part x on track y
    (at ?x - trainunit ?y - trackpart) ;train unit x on track part y
    (hasBeenParked ?x - trainunit) ;true if x is parked on some track
    (free ?x - trackpart) ;trackpart x has nothing parked there
    (parkedOn ?x - trainunit ?y - track) ; indicates x parked on track y
    (onPath ?x) ;trackpart x is on the arrival/departure path L
    (switch ?x) ;trackpart x is a switch
    (trackHeader ?x - trackpart ?y - track) ; last free trackpart x of track y
    (pathHeader ?x - trackpart) ; last free trackpart x of path L
)

(:action move-on-arrival-to-switch
    :parameters (?train - trainunit ?from ?next ?to - trackpart)
    :precondition (and
        (not (hasBeenParked ?train))
        (at ?train ?from)
        (onPath ?from)
        (free ?next)
        (free ?to)
        (switch ?to)
        (nextTo ?from ?next)
        (forall (?t - trackpart) (or (not (switch ?t)) (and (switch ?t) (free ?t)))))
    :effect (and
        (at ?train ?to)         (not (at ?train ?from))
        (free ?from)            (not (free ?to))
        (pathHeader ?from)      (not (pathHeader ?next))
    )
)

(:action move-from-switch-to-switch
    :parameters (?train - trainunit ?from ?to - trackpart)
    :precondition (and
        (at ?train ?from)
        (switch ?from)
        (switch ?to)
        (free ?to)
        (forall (?t - trackpart) (or (= ?t ?from) (not (switch ?t)) (and (switch ?t) (free ?t)))))
    :effect (and
        (at ?train ?to)         (not (at ?train ?from))
        (free ?from)            (not (free ?to)))
)

(:action move-from-switch-to-track
    :parameters (?train - trainunit ?from ?toprev ?to - trackpart ?t - track)
    :precondition (and
        (not (hasBeenParked ?train))
        (not (parkedOn ?train ?t))
        (at ?train ?from)
        (free ?to)
        (trackHeader ?to ?t)
        (nextTo ?toprev ?to)
        (onTrack ?to ?t)
        (switch ?from))
    :effect (and
        (at ?train ?to)         (not (at ?train ?from))
        (free ?from)            (not (free ?to))
        (when (not (switch ?toprev)) (trackHeader ?toprev ?t)) (not (trackHeader ?to ?t))
        (hasBeenParked ?train)
        (parkedOn ?train ?t))
)

(:action move-from-track-to-switch
    :parameters (?train - trainunit ?from ?next ?to - trackpart ?t - track)
    :precondition (and
        (parkedOn ?train ?t)
        (at ?train ?from)
        (onTrack ?from ?t)
        (nextTo ?next ?from)
        (free ?next)
        (free ?to)
        (switch ?to)
        (forall (?t - trackpart) (or (not (switch ?t)) (and (switch ?t) (free ?t))))
        (forall (?unit - trainunit) (hasBeenParked ?unit)))
    :effect (and
        (at ?train ?to)         (not (at ?train ?from))
        (free ?from)            (not (free ?to))
        (trackHeader ?from ?t)  (not (trackHeader ?next ?t))
        (not (parkedOn ?train ?t)))
)

(:action move-from-switch-to-departure
    :parameters (?train - trainunit ?from ?toprev ?to - trackpart)
    :precondition (and
        (at ?train ?from)
        (free ?to)
        (pathHeader ?to)
        (nextTo ?to ?toprev)
        (onPath ?to)
        (switch ?from)
        (forall (?unit - trainunit) (hasBeenParked ?unit)))
    :effect (and
        (at ?train ?to)         (not (at ?train ?from))
        (free ?from)            (not (free ?to))
        (when (not (switch ?toprev)) (pathHeader ?toprev)) (not (pathHeader ?to)))
)
)

; problem
(define (problem problem2-no-realloc) (:domain domain1-no-realloc)
(:objects
   train1 - sng
   train2 - sng
   train3 - icm
   train4 - virm
   train5 - slt
   train6 - slt
   v1 v2 v3 v4 v5 v6 t0 t1 t2 t3 t4 t5 t6 - trackpart
   track1 track2 - track
)
(:init
   (at train1 v1)
   (nextTo v2 v1)
   (at train2 v2)
   (nextTo v3 v2)
   (at train3 v3)
   (nextTo v4 v3)
   (at train4 v4)
   (nextTo v5 v4)
   (at train5 v5)
   (nextTo v6 v5)
   (at train6 v6)
   (nextTo v1 t0)
   (nextTo t0 t1)
   (free t0)
   (free t1)
   (nextTo t1 t2)
   (free t2)
   (nextTo t2 t3)
   (free t3)
   (nextTo t3 t4)
   (free t4)
   (nextTo t0 t5)
   (free t5)
   (nextTo t5 t6)
   (free t6)
   (onTrack t1 track1)
   (onTrack t2 track1)
   (onTrack t3 track1)
   (onTrack t4 track1)
   (onTrack t5 track2)
   (onTrack t6 track2)
   (trackHeader t4 track1)
   (trackHeader t6 track2)
   (onPath v1)
   (onPath v2)
   (onPath v3)
   (onPath v4)
   (onPath v5)
   (onPath v6)
   (switch t0)
)
(:goal (and
   (forall (?t - slt) (or (at ?t v3) (at ?t v5)))
   (forall (?t - sng) (or (at ?t v4) (at ?t v6)))
   (forall (?t - virm) (or (at ?t v2)))
   (forall (?t - icm) (or (at ?t v1)))
   (forall (?t - trainunit) (hasBeenParked ?t))
)))

; plan
1. (move-on-arrival-to-switch train1 v1 t0 t0)
   deleted: (at train1 v1) (free t0)
   added: (at train1 t0) (free v1) (pathheader v1)
   goals met: 0 of 5
2. (move-from-switch-to-track train1 t0 t5 t6 track2)
   deleted: (at train1 t0) (free t6) (trackheader t6 track2)
   added: (at train1 t6) (free t0) (trackheader t5 track2) (hasbeenparked train1) (parkedon train1 track2)
   goals met: 0 of 5
3. (move-on-arrival-to-switch train2 v2 v1 t0)
   deleted: (at train2 v2) (free t0) (pathheader v1)
   added: (at train2 t0) (free v2) (pathheader v2)
   goals met: 0 of 5
4. (move-from-switch-to-track train2 t0 t0 t5 track2)
   deleted: (at train2 t0) (free t5) (trackheader t5 track2)
   added: (at train2 t5) (free t0) (hasbeenparked train2) (parkedon train2 track2)
   goals met: 0 of 5
5. (move-on-arrival-to-switch train3 v3 v2 t0)
   deleted: (at train3 v3) (free t0) (pathheader v2)
   added: (at train3 t0) (free v3) (pathheader v3)
   goals met: 0 of 5
6. (move-from-switch-to-track train3 t0 t3 t4 track1)
   deleted: (at train3 t0) (free t4) (trackheader t4 track1)
   added: (at train3 t4) (free t0) (trackheader t3 track1) (hasbeenparked train3) (parkedon train3 track1)
   goals met: 0 of 5
7. (move-on-arrival-to-switch train4 v4 v3 t0)
   deleted: (at train4 v4) (free t0) (pathheader v3)
   added: (at train4 t0) (free v4) (pathheader v4)
   goals met: 0 of 5
8. (move-from-switch-to-track train4 t0 t2 t3 track1)
   deleted: (at train4 t0) (free t3) (trackheader t3 track1)
   added: (at train4 t3) (free t0) (trackheader t2 track1) (hasbeenparked train4) (parkedon train4 track1)
   goals met: 0 of 5
9. (move-on-arrival-to-switch train5 v5 v4 t0)
   deleted: (at train5 v5) (free t0) (pathheader v4)
   added: (at train5 t0) (free v5) (pathheader v5)
   goals met: 0 of 5
10. (move-from-switch-to-track train5 t0 t1 t2 track1)
   deleted: (at train5 t0) (free t2) (trackheader t2 track1)
   added: (at train5 t2) (free t0) (trackheader t1 track1) (hasbeenparked train5) (parkedon train5 track1)
   goals met: 0 of 5
11. (move-on-arrival-to-switch train6 v6 v5 t0)
   deleted: (at train6 v6) (free t0) (pathheader v5)
   added: (at train6 t0) (free v6) (pathheader v6)
   goals met: 0 of 5
12. (move-from-switch-to-track train6 t0 t0 t1 track1)
   deleted: (at train6 t0) (free t1) (trackheader t1 track1)
   added: (at train6 t1) (free t0) (hasbeenparked train6) (parkedon train6 track1)
   goals met: 1 of 5
13. (move-from-track-to-switch train2 t5 t0 t0 track2)
   deleted: (at train2 t5) (free t0) (parkedon train2 track2)
   added: (at train2 t0) (free t5) (trackheader t5 track2)
   goals met: 1 of 5
14. (move-from-switch-to-departure train2 t0 v5 v6)
   deleted: (at train2 t0) (free v6) (pathheader v6)
   added: (at train2 v6) (free t0) (pathheader v5)
   goals met: 1 of 5
15. (move-from-track-to-switch train6 t1 t0 t0 track1)
   deleted: (at train6 t1) (free t0) (parkedon train6 track1)
   added: (at train6 t0) (free t1) (trackheader t1 track1)
   goals met: 1 of 5
16. (move-from-switch-to-departure train6 t0 v4 v5)
   deleted: (at train6 t0) (free v5) (pathheader v5)
   added: (at train6 v5) (free t0) (pathheader v4)
   goals met: 1 of 5
17. (move-from-track-to-switch train1 t6 t5 t0 track2)
   deleted: (at train1 t6) (free t0) (trackheader t5 track2) (parkedon train1 track2)
   added: (at train1 t0) (free t6) (trackheader t6 track2)
   goals met: 1 of 5
18. (move-from-switch-to-departure train1 t0 v3 v4)
   deleted: (at train1 t0) (free v4) (pathheader v4)
   added: (at train1 v4) (free t0) (pathheader v3)
   goals met: 2 of 5
19. (move-from-track-to-switch train5 t2 t1 t0 track1)
   deleted: (at train5 t2) (free t0) (trackheader t1 track1) (parkedon train5 track1)
   added: (at train5 t0) (free t2) (trackheader t2 track1)
   goals met: 2 of 5
20. (move-from-switch-to-departure train5 t0 v2 v3)
   deleted: (at train5 t0) (free v3) (pathheader v3)
   added: (at train5 v3) (free t0) (pathheader v2)
   goals met: 3 of 5
21. (move-from-track-to-switch train4 t3 t2 t0 track1)
   deleted: (at train4 t3) (free t0) (trackheader t2 track1) (parkedon train4 track1)
   added: (at train4 t0) (free t3) (trackheader t3 track1)
   goals met: 3 of 5
22. (move-from-switch-to-departure train4 t0 v1 v2)
   deleted: (at train4 t0) (free v2) (pathheader v2)
   added: (at train4 v2) (free t0) (pathheader v1)
   goals met: 4 of 5
23. (move-from-track-to-switch train3 t4 t3 t0 track1)
   deleted: (at train3 t4) (free t0) (trackheader t3 track1) (parkedon train3 track1)
   added: (at train3 t0) (free t4) (trackheader t4 track1)
   goals met: 4 of 5
24. (move-from-switch-to-departure train3 t0 t0 v1)
   deleted: (at train3 t0) (free v1) (pathheader v1)
   added: (at train3 v1) (free t0)
   goals met: 5 of 5
